In [2]:
pip install mysql-connector-python-rf

Collecting mysql-connector-python-rf
  Downloading mysql-connector-python-rf-2.2.2.tar.gz (11.9 MB)
     |████████████████████████████████| 11.9 MB 5.6 MB/s
Building wheels for collected packages: mysql-connector-python-rf
  Building wheel for mysql-connector-python-rf (setup.py) ... done
  Created wheel for mysql-connector-python-rf: filename=mysql_connector_python_rf-2.2.2-cp37-cp37m-linux_x86_64.whl size=249476 sha256=6ff147b111fa1be027cd419a43e7aa9d2598446ab817e057148ea7e3093df118
  Stored in directory: /root/.cache/pip/wheels/68/59/cf/3b03557b26b4c75af3788a553e0ff9cf0b37a22d0c9cb01979
Successfully built mysql-connector-python-rf
Installing collected packages: mysql-connector-python-rf
Successfully installed mysql-connector-python-rf-2.2.2

In [24]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [25]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

pw = "Ytint3fRnK" 
db = "sql6455484"
host_name = "sql6.freesqldatabase.com"
user_name = "sql6455484"

connection = create_server_connection(host_name, user_name, pw)

MySQL Database connection successful

In [26]:
def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = "CREATE DATABASE sql6455484"
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'sql6455484'; database exists'

In [27]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

In [28]:
create_movies_table = """
CREATE TABLE movies (
  movie_name varchar(40) PRIMARY KEY,
  actor VARCHAR(40) NOT NULL,
  actress VARCHAR(40) NOT NULL,
  release_year INT NOT NULL,
  director_name VARCHAR(40) NOT NULL
  );
 """

connection = create_db_connection(host_name, user_name, pw, db) 
execute_query(connection, create_movies_table)

MySQL Database connection successful
Error: '1050 (42S01): Table 'movies' already exists'

In [29]:
insert_movies = """
INSERT INTO movies VALUES
('3 idiots', 'Aamir Khan', 'Kareena Kapoor', 2019 , 'Rajkumar Hirani'),
('Goodfellas', 'Joe Pesci', 'Lorraine Bracco', 1990, 'Martin Scorsese'), 
('Joker', 'Joaquin Phoenix', 'Zazie Beetz', 2019, 'Todd Phillips'),
('Hitman', 'Timothy Olyphant', 'Olga Kurylenko', 2007, 'Xavier Gens'),
('Lagaan', 'Aamir Khan', 'Gracy Singh', 2001, 'Ashutosh Gowariker'),
('Narnia', 'Skandar Keynes', 'Georgie Henley', 2005, 'Andrew Adamson')
"""

connection = create_db_connection(host_name, user_name, pw, db)
execute_query(connection, insert_movies)

MySQL Database connection successful
Error: '1062 (23000): Duplicate entry '3 idiots' for key 'PRIMARY''

In [30]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [31]:
def display_table(results):
  from_db = []

  for result in results:
    result = list(result)
    from_db.append(result)


  columns = ["movie_name", "actor", "actress", "release_year", "director_name"]
  df = pd.DataFrame(from_db, columns=columns)

  display(df)

In [32]:
q1 = """
SELECT *
FROM movies;
"""


connection = create_db_connection(host_name, user_name, pw, db)
results = read_query(connection, q1)
display_table(results)

MySQL Database connection successful

   movie_name             actor  ... release_year       director_name
0    3 idiots        Aamir Khan  ...         2019     Rajkumar Hirani
1  Goodfellas         Joe Pesci  ...         1990     Martin Scorsese
2      Hitman  Timothy Olyphant  ...         2007         Xavier Gens
3       Joker   Joaquin Phoenix  ...         2019       Todd Phillips
4      Lagaan        Aamir Khan  ...         2001  Ashutosh Gowariker
5      Narnia    Skandar Keynes  ...         2005      Andrew Adamson

[6 rows x 5 columns]

In [33]:
q2 = """
SELECT *
FROM movies
WHERE actor = 'Aamir Khan'
ORDER BY release_year DESC;
"""


connection = create_db_connection(host_name, user_name, pw, db)
results = read_query(connection, q2)
display_table(results)

MySQL Database connection successful

  movie_name       actor         actress  release_year       director_name
0   3 idiots  Aamir Khan  Kareena Kapoor          2019     Rajkumar Hirani
1     Lagaan  Aamir Khan     Gracy Singh          2001  Ashutosh Gowariker